In [1]:
import pandas as pd
import numpy as np
import statistics

In [2]:
df = pd.read_csv("loan_data_set.csv")
df.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [3]:
print("ApplicantIncome:-")
print(df.loc[:,"ApplicantIncome"].mean())

ApplicantIncome:-
5403.459283387622

In [4]:
print("ApplicantIncome Median:-")
print(df.loc[:,"ApplicantIncome"].median())

ApplicantIncome Median:-
3812.5

In [5]:
print("ApplicantIncome Minimum:-")
print(df.loc[:,"ApplicantIncome"].min())

ApplicantIncome Minimum:-
150

In [6]:
print("ApplicantIncome maxium:-")
print(df.loc[:,"ApplicantIncome"].max())

ApplicantIncome maxium:-
81000

In [7]:
print("ApplicantIncome standard deviation:-")
print(df.loc[:,"ApplicantIncome"].std())

ApplicantIncome standard deviation:-
6109.041673387174

In [8]:
print("Group By:-")
df.groupby(df['Gender']).ApplicantIncome.agg(['min','max','median','std'])

Group By:-

        min    max  median          std
Gender
Female  210  19484  3583.0  3585.381488
Male    150  81000  3865.0  6185.789262

In [9]:
df.describe()

,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History
count,614.000000,614.000000,592.000000,600.00000,564.000000
mean,5403.459283,1621.245798,146.412162,342.00000,0.842199
std,6109.041673,2926.248369,85.587325,65.12041,0.364878
min,150.000000,0.000000,9.000000,12.00000,0.000000
25%,2877.500000,0.000000,100.000000,360.00000,1.000000
50%,3812.500000,1188.500000,128.000000,360.00000,1.000000
75%,5795.000000,2297.250000,168.000000,360.00000,1.000000
max,81000.000000,41667.000000,700.000000,480.00000,1.000000

In [10]:
gk=df.groupby('Gender')
gk.first()
gk.get_group('Male')

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y
...,...,...,...,...,...,...,...,...,...,...,...,...,...
607,LP002964,Male,Yes,2,Not Graduate,No,3987,1411.0,157.0,360.0,1.0,Rural,Y
608,LP002974,Male,Yes,0,Graduate,No,3232,1950.0,108.0,360.0,1.0,Rural,Y
610,LP002979,Male,Yes,3+,Graduate,No,4106,0.0,40.0,180.0,1.0,Rural,Y
611,LP002983,Male,Yes,1,Graduate,No,8072,240.0,253.0,360.0,1.0,Urban,Y
612,LP002984,Male,Yes,2,Graduate,No,7583,0.0,187.0,360.0,1.0,Urban,Y

IRIS DATASET

In [11]:
df1=pd.read_csv('Iris.csv')
df1.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [12]:
print("Mean of SepalWidthCm grouped by Species")
df1.groupby(["Species"])["SepalWidthCm"].mean()

Mean of SepalWidthCm grouped by Species

Species
Iris-setosa        3.418
Iris-versicolor    2.770
Iris-virginica     2.974
Name: SepalWidthCm, dtype: float64

In [13]:
print("Maxium of SepalWidthCm grouped by Species")
df1.groupby(["Species"])["SepalWidthCm"].median()

Maxium of SepalWidthCm grouped by Species

Species
Iris-setosa        3.4
Iris-versicolor    2.8
Iris-virginica     3.0
Name: SepalWidthCm, dtype: float64

In [14]:
print("Standard deviation of SepalWidthCm grouped by Species")
df1.groupby(["Species"])["SepalWidthCm"].std()

Standard deviation of SepalWidthCm grouped by Species

Species
Iris-setosa        0.381024
Iris-versicolor    0.313798
Iris-virginica     0.322497
Name: SepalWidthCm, dtype: float64

In [15]:
print("Mean of SepalWidthCm grouped by Species")
df1.groupby(["Species"])["SepalWidthCm"].median()

Mean of SepalWidthCm grouped by Species

Species
Iris-setosa        3.4
Iris-versicolor    2.8
Iris-virginica     3.0
Name: SepalWidthCm, dtype: float64